---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalSystem.WireType
source: html/d605965d-bbed-c3c9-14fa-2d040ec76dca.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSystem.WireType Property

The wire type of the Electrical System.

## Syntax (C#)
```csharp
public WireType WireType { get; set; }
```

## Remarks
This property is used to retrieve the wire type of the Electrical System.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null
- **Autodesk.Revit.Exceptions.DisabledDisciplineException** - When setting this property: None of the following disciplines is enabled: Mechanical Electrical Piping.